app/controllers/events_controller.rb

SELECT "events".* FROM "events"  ORDER BY "events"."created_at" DESC
---
  def index
    @events = Event.all